# I. Series

In [2]:
import numpy as np
import pandas as pd

In [2]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=label) #specify a list as index

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(d) # pandas can take a dictionary and convert it to series

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data=[sum,print,len]) # can pass in function and pandas will hold those

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [16]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser3 = pd.Series(label)
ser3

0    a
1    b
2    c
dtype: object

In [13]:
ser3[0]

'a'

In [18]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# II. DataFrames

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101) # use seed so that the random values will be the same?

In [87]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
type(df['W'])

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df.W # Just like sql, but not recommended since pandas may get confused a column with a built-in function

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
df[['W','Z']] # Pass in a list to index multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [38]:
df['new'] = df['W'] + df['Y']

In [29]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df.drop('new', axis=1,inplace=True) # To delete a column, make sure to check axis and inplace to permanently remove column

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.shape

(5, 4)

In [45]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

### Selecting Rows: 2 methods

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
# First method: using label
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [50]:
# Second method: using label index
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### Slicing

In [49]:
df.loc['B','Y']

-0.84807698340363147

In [51]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Conditional Selection

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
booldf = df > 0

In [56]:
df[booldf] #NaN are value that are < 0 (False)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
# Or you can do:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [67]:
resultdf = df[df['W'] > 0] # Only returns rows in column W that has value > 0 (True)

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [68]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [73]:
df[df['W']>0][['Y','X']] #multiple, make sure to use list when slicing multiple columns

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [77]:
#breaking it down but hmm i think i got the other way
boolser = df['W'] > 0
result = df[boolser]

In [78]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Multiple conditions

In [79]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
# Multiple conditions: 
df[(df['W']>0) & (df['Y']>1)] #use & not 'and', because the 'and' in pandas can only handle 1 condition at once

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [81]:
# 'Or' condition:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df.reset_index() #use inplace = True to permanently modify df

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [88]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [90]:
newind = 'CA NY WY OR CO'.split() # Splitting a string by blank space

In [91]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [92]:
df['State'] = newind

In [93]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR
E -0.116773  1.901755  0.238127  1.996652    CO

In [94]:
df.set_index('State') # Set a column as the index of a data frame

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
WY     0.807706  0.072960  0.638787  0.329646
OR    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

## Multi index & Index Hierarchy

In [95]:
# Index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [96]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [99]:
inside

[1, 2, 3, 1, 2, 3]

In [100]:
# Using zip() to create pair of values from 2 lists
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [98]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [101]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [102]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

### Slicing index hierarchy

In [103]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [104]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [106]:
df.index.names

FrozenList([None, None])

In [108]:
df.index.names = ['Groups','Num'] # Setting indexes names

In [109]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [111]:
df.loc['G2'].loc[2]['B']

-0.61025885582274142

In [112]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [113]:
df.loc['G1']

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [114]:
df.xs('G1') # Cross section indexing?

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [115]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

# III. Missing Data

In [116]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [117]:
df = pd.DataFrame(d)

In [118]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [119]:
df.dropna() # Drop all rows  that has NA value

     A    B  C
0  1.0  5.0  1

In [121]:
df.dropna(axis=1) # Drop all columns that has NA value

   C
0  1
1  2
2  3

In [122]:
df.dropna(thresh=2) # thresh: at least how many NA values to drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [123]:
# Replacing NA value: Fillna() method
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [124]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# IV. Groupby

In [125]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [126]:
df = pd.DataFrame(data)

In [127]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [129]:
byComp = df.groupby('Company')

In [130]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [131]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [132]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [134]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [136]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [138]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [139]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [140]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# V. Merging, Joining, and Concatenating

In [4]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [5]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [6]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [7]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [9]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [10]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [12]:
pd.concat([df1,df2,df3]) # Pass the df on by using list

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [14]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [15]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [16]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [18]:
pd.merge(left, right, how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

### More complicated example on Merging

In [19]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [20]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

### Joining

In [21]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [22]:
left.join(right) # Inner join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [23]:
left.join(right,how='outer') # Outer join

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# VI. Operations

In [24]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Finding unique values

In [25]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [26]:
df['col2'].nunique() # Return number of unique values

3

In [27]:
df['col2'].value_counts() # Count number of time each value appears

444    2
555    1
666    1
Name: col2, dtype: int64

In [30]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [31]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [33]:
# To combine conditions:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### The Apply method

In [34]:
def times2(x):
    return x * 2

In [35]:
df['col1'].apply(times2) # Apply() allows us to use a custom function

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [40]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [41]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [43]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [44]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [48]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Finding null values

In [49]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Table

In [50]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [51]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [52]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# VII. Data Input and Output

In [53]:
import sqlalchemy

In [55]:
pwd

'C:\\Users\\Linh'

In [57]:
df = pd.read_csv('LE5_1.csv')

In [59]:
df.to_csv('My_output', index=False) #check if index = False needed

## To read xlsx file
    pd.read_excel('file_name.xlsx', sheetname= 'Something')
## To output xlsx file
    df.to_excel('New_file.xlsx',sheet_name='NewSheet')
## To read html
    data = pd.read_html('paste link url here')
    type(data) is list

## Read from sql

In [60]:
from sqlalchemy import create_engine

In [61]:
engine = create_engine('sqlite:///:memory:')

In [62]:
df.to_sql('my_table',engine)

In [63]:
sqldf = pd.read_sql('my_table',con=engine)

In [64]:
sqldf

    index Gender Education  Studying Hour per day  weight  watching TV
0       0      f        BS                      3   166.0            3
1       1      f        BS                      5   256.0            3
2       2      f        BS                      3   120.0            5
3       3      f        BS                      4   189.0            5
4       4      f        BS                      5   124.0            2
5       5      f        BS                      4   162.0            3
6       6      f        BS                      1   157.0            5
7       7      f        MS                      3   203.0            2
8       8      f        MS                      5   219.0            1
9       9      f        MS                      5   154.0            3
10     10      f       PHD                     10   139.0            1
11     11      f       PHD                     11   190.0            1
12     12      f       PHD                      5   183.0            1
13     13      f        BS                      1   255.0            4
14     14      m        BS                      2   226.0            4
15     15      f        BS                      1   137.0            5
16     16      m        MS                      7   120.0            2
17     17      m        MS                      7   134.0            3
18     18      m        MS                      7   122.0            3
19     19      m        MS                      5   105.0            4
20     20      m        MS                      3   188.0            4
21     21      m       PHD                     11   161.0            1
22     22      f        BS                      5   220.0            2
23     23      f        BS                      2   229.0            2
24     24      f        MS                      6   224.0            3
25     25      m        BS                      4   158.0            4
26     26      m        MS                      7     NaN            4
27     27      f        BS                      1   255.0            3
28     28      f       PHD                      8   152.0            1
29     29      f       PHD                      5   188.0            1
..    ...    ...       ...                    ...     ...          ...
59     59      m        MS                      7   197.0            2
60     60      m        MS                      6   129.0            4
61     61      m        BS                      4   230.0            6
62     62      m        BS                      3   156.0            6
63     63      m        BS                      4   151.0            5
64     64      m        BS                      1   234.0            2
65     65      m        BS                      5     NaN            5
66     66      m        BS                      5   126.0            2
67     67      m        BS                      5   242.0            2
68     68      m       PHD                     10   117.0            1
69     69      m       PHD                      6   120.0            1
70     70      m       PHD                      9   190.0            1
71     71      m       PHD                      7   200.0            1
72     72      m        MS                      5   176.0            2
73     73      m       PHD                     11    97.0            1
74     74      f        BS                      2   117.0            5
75     75      m        BS                      4   197.0            6
76     76      f        BS                      5   256.0            3
77     77      m        MS                      5    99.0            4
78     78      m        MS                      6   212.0            4
79     79      f        MS                      6   119.0            3
80     80      f        MS                      7   163.0            2
81     81      f        BS                      3   155.0            3
82     82      m        BS                      3   190.0            3
83     83      m        BS                      1   206.0            4
84     84      f        BS                      2   139.0            5
85     85      f        BS                      5     NaN            3
86     86      f        BS                      2   129.0            5
87     87      f        BS                      1   154.0            5
88     88      m        BS                      5   182.0            2

[89 rows x 6 columns]